# Advanced SQL Query

```sql
-- Preparation --
BEGIN;

-- Rename Tables
ALTER TABLE crunchbase_companies_clean_data RENAME TO companies;
ALTER TABLE dc_bikeshare_q1_2012 RENAME TO bikeshare;

-- Create Tables
CREATE TABLE players (
    full_school_name VARCHAR(255),
    school_name VARCHAR(255),
    player_name VARCHAR(255),
    position VARCHAR(255),
    height FLOAT,
    weight FLOAT,
    year VARCHAR(255),
    hometown VARCHAR(255),
    state VARCHAR(255),
    id INT PRIMARY KEY
);

CREATE TABLE teams (
    division VARCHAR(100),
    conference VARCHAR(100),
    school_name VARCHAR(100),
    roster_url VARCHAR(200),
    id INT PRIMARY KEY
);

-- Input Data
COPY teams(division, conference, school_name, roster_url, id)
FROM '/private/var/tmp/teams.csv'
DELIMITER ','
CSV HEADER;

COPY players(full_school_name, school_name, player_name, position, height, weight, year, hometown, state, id)
FROM '/private/var/tmp/players.csv'
DELIMITER ','
CSV HEADER;

COMMIT;

-------------------------
-- SQL Window Function --
-------------------------

-- Breakdown --
SELECT AVG(duration_seconds) FROM bikeshare;	--return 1 row
SELECT duration_seconds FROM bikeshare;		--return 100 row
--and if we do this...
SELECT
	duration_seconds,
	AVG(duration_seconds)
FROM bikeshare;
--...will error because different rows
--Instread, we will do this
SELECT
	duration_seconds,
	AVG(duration_seconds) OVER()
FROM bikeshare;

-- Partition By & Order By --
-- Order By
-- Untuk melihat total durasi peminjaman melihat waktu pinjam
SELECT
	id,
	start_time,
	duration_seconds,
	SUM(duration_seconds) OVER(ORDER BY start_time)
FROM bikeshare;
-- Partition By
-- Melihat rerata durasi peminjaman di setiap start station
SELECT
	id,
	start_station,
	duration_seconds,
	AVG(duration_seconds) OVER(PARTITION BY start_station)
FROM bikeshare;
-- Combine
-- Untuk melihat total durasi peminjaman pada setiap start station diurutkan berdasarkan start time
SELECT
	id,
	start_time,
	start_station,
	duration_seconds,
	SUM(duration_seconds) OVER(PARTITION BY start_station ORDER BY start_time)
FROM bikeshare;

-- Aggregation --
SELECT
	id,
	start_station,
	duration_seconds,
	SUM(duration_seconds) OVER(PARTITION BY start_station) AS total_duration,
	COUNT(duration_seconds) OVER(PARTITION BY start_station) total_trip,
	AVG(duration_seconds) OVER(PARTITION BY start_station) "average duration",
	MIN(duration_seconds) OVER(PARTITION BY start_station) AS "minimum duration",
	MAX(duration_seconds) OVER(PARTITION BY start_station) maximum_duration
FROM bikeshare;

-- Ranking Function --
-- Row Number
SELECT
	id,
	start_station,
	duration_seconds,
	-- mengurutkan berdasarkan durasinya
	ROW_NUMBER() OVER(ORDER BY duration_seconds)
FROM bikeshare;
-- Rank & Dense Rank
SELECT
	id,
	start_station,
	duration_seconds,
	-- mengurutkan berdasarkan durasinya
	ROW_NUMBER() OVER(ORDER BY duration_seconds),
	-- me-ranking berdasarkan durasinya
	RANK() OVER(ORDER BY duration_seconds),		-- Jika nilainya sama sebenarnya dianggap beda
	DENSE_RANK() OVER(ORDER BY duration_seconds)	-- Jika nilainya sama dan benar-benar dianggap sama
FROM bikeshare;
-- Untuk memfilter dense rank diatas 93 (subquery)
SELECT *
FROM
	(SELECT
		id,
		start_station,
		duration_seconds,
		-- mengurutkan berdasarkan durasinya
		ROW_NUMBER() OVER(ORDER BY duration_seconds),
		-- me-ranking berdasarkan durasinya
		RANK() OVER(ORDER BY duration_seconds),
		DENSE_RANK() OVER(ORDER BY duration_seconds) AS denserank
	FROM bikeshare) AS subs
WHERE subs.denserank > 93;

-- Distribution Function --
-- Percent Rank & Cumulative Distribution
-- Distribusi durasi peminjaman sepeda
SELECT
	id,
	start_station,
	duration_seconds,
	PERCENT_RANK() OVER(ORDER BY duration_seconds),
	CUME_DIST() OVER(ORDER BY duration_seconds)
FROM bikeshare;
-- Distribusi modal perusahaan
SELECT
	id,
	name,
	-- Handling missing value modalnya dianggap sebagai 0
	COALESCE(funding_total_usd, 0),
	PERCENT_RANK() OVER(ORDER BY COALESCE(funding_total_usd, 0)),
	CUME_DIST() OVER(ORDER BY COALESCE(funding_total_usd, 0))
FROM companies;

-- Analytic Function --
-- Lag & Lead
SELECT
	id,
	start_time,
	duration_seconds,
	--LAG(<nama kolom>, jumlah lag, isi missing value)
	LAG(duration_seconds, 1, 0) OVER(ORDER BY start_time) AS turun_1,
	duration_seconds - LAG(duration_seconds, 1, 0) OVER(ORDER BY start_time) AS different_than_before,
	LEAD(duration_seconds, 1) OVER(ORDER BY start_time) AS naik_1,
	LAG(duration_seconds, 2) OVER(ORDER BY start_time) AS turun_2,
	LEAD(duration_seconds, 5, 0) OVER(ORDER BY start_time) AS naik_5
FROM bikeshare;

-- N-Tile
SELECT
	id,
	start_station,
	duration_seconds,
	NTILE(4) OVER() AS quartile,
	NTILE(5) OVER() AS quintile,
	NTILE(10) OVER() AS decile,
	NTILE(100) OVER() AS percentile
FROM bikeshare;

-- First Value, Last Value, & N-th Value
SELECT
	id,
	start_station,
	duration_seconds,
	FIRST_VALUE(duration_seconds) OVER(PARTITION BY start_station),					-- Ambil data pertama
	LAST_VALUE(duration_seconds) OVER(PARTITION BY start_station),						-- Ambil data terakhir
	NTH_VALUE(duration_seconds, 2) OVER(PARTITION BY start_station) AS second_value	-- Ambil urutan data yang diinginkan (2)
FROM bikeshare;

-----------------------
-- Pivot Data in SQL --
-----------------------
-- Jumlah pemain american footbal disetiap conference dan tingkat tahun
SELECT
	t.conference AS conference,	--1
	p.year,						--2
	COUNT(1) AS total_players
FROM players AS p
JOIN teams AS t
	ON t.school_name = p.school_name
GROUP BY 1, 2;
-- 1 refer to first thing called (conference column in teams table)
-- 2 refer to second thing called (year column in players table)
-- Sub-Query
SELECT
	main.conference,															--1
	SUM(CASE WHEN year = 'FR' THEN total_players ELSE NULL END) AS freshman,	--2
	SUM(CASE WHEN year = 'SO' THEN total_players ELSE NULL END) AS sophomore,	--3
	SUM(CASE WHEN year = 'JR' THEN total_players ELSE NULL END) AS junior,		--4
	SUM(CASE WHEN year = 'SR' THEN total_players ELSE NULL END) AS senior		--5
FROM
	(SELECT
		t.conference AS conference,
		p.year,
		COUNT(1) AS total_players
	FROM players AS p
	JOIN teams AS t
		ON t.school_name = p.school_name
	GROUP BY 1, 2) AS main
GROUP BY 1
ORDER BY 1 DESC;

-- Untuk lihat data
SELECT * FROM companies;
SELECT * FROM bikeshare;
SELECT * FROM teams;
SELECT * FROM players;
SELECT * FROM students;
SELECT * FROM avg_grade_age;
SELECT * FROM profile;
```

# Connect Python to PostgresSQL localhost

**RUN ON LOCAL (VSCODE)**

## Instal Libraries

In [ ]:
!pip install -q psycopg2
!pip install -q sqlalchemy
!pip install -q sqlalchemy_utils

## Psycopg2

In [ ]:
import psycopg2
from psycopg2 import sql

In [ ]:
# Replace these parameters with your actual database credentials
db_user = "postgres"
db_password = "123456" #Use your own password
db_host = "localhost"  # Usually "localhost" if running locally
db_port = "5432"       # Default is 5432

# Koneksi dan menyimpan informasi koneksi dalam `connection`
connection = psycopg2.connect(
                                user=db_user,
                                password=db_password,
                                host=db_host,
                                port=db_port
)

In [ ]:
# Membuat instance/object koneksi `yosef` untuk menjalankan SQL query dalam python
yosef = connection.cursor()

### Create Database (psycopg2)

In [ ]:
connection.autocommit = True

# Menyimpan query SQL dalam `q`
q = sql.SQL('CREATE DATABASE pysql_yosef;')

# Eksekusi query
yosef.execute(q)

# Close the connection
yosef.close()
connection.close()

### Create Table (psycopg2)

In [ ]:
# Pindah koneksi ke database yang baru
connection = psycopg2.connect(
    user=db_user,
    password=db_password,
    host=db_host,
    port=db_port,
    database="pysql_yosef"
)

# Membuat instance/object koneksi `yosef` untuk menjalankan SQL query dalam python
yosef = connection.cursor()

# Menyimpan query SQL dalam `q`
q = sql.SQL('''CREATE TABLE IF NOT EXISTS students(
    id SERIAL PRIMARY KEY,
    name VARCHAR(50),
    age INTEGER,
    campus_id INTEGER,
    total_grade FLOAT
);''')

# Eksekusi query menggunakan `execute` karena hanya ada satu
yosef.execute(q)
connection.commit()

### Insert Data (psycopg2)

In [ ]:
# Menyiapkan daftar/list data; urutannya sesuai urutan kolom yang ada
data_values = [
    ('Rafif Iman', 20, 1, 85.5),
    ('Hana Arisona', 21, 2, 90.2),
    ('Raka Purnomo', 19, 1, 78.9),
    ('Danu Irfansyah', 20, 3, 92.7),
    ('Rachman Ardhi', 22, 2, 88.1)
    ]

# Menyimpan query SQL dalam `insert_query`
insert_query = "INSERT INTO students (name, age, campus_id, total_grade) VALUES (%s,%s,%s,%s)"

# Eksekusi query menggunakan `executemany` karena lebih dari satu
yosef.executemany(insert_query, data_values)
connection.commit()

### Connect to Pandas

In [ ]:
import pandas as pd

### SELECT Query (psycopg2)

In [ ]:
# Menyimpan query SQL dalam `select_query` dalam docstring
select_query = '''SELECT
                      campus_id,
                      MIN(age) AS min_age,
                      MAX(age) AS max_age
                  FROM students
                  GROUP BY campus_id;'''

# Query tersebut dibaca dan disimpan hasilnya dalam `df` menggunakan Pandas
df = pd.read_sql_query(select_query, connection)

# Menampilkan dataframe yang tersimpan
df

/var/folders/n5/yxbkb105257g9py6q62wp55c0000gn/T/ipykernel_61419/261529693.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(select_query, connection)

   campus_id  min_age  max_age
0          3       20       20
1          2       21       22
2          1       19       20

## SQL Alchemy

### Create Engine (sqlalchemy)

In [ ]:
from sqlalchemy import create_engine, text

In [ ]:
# Create engine or connection langsung ke databasenya (pysql_yosef)
engine_yosef = create_engine("postgresql://postgres:123456@localhost/pysql_yosef")

### SELECT Query (sqlalchemy)

In [ ]:
# Menyimpan query SQL dalam `sql_query`
sql_query = 'SELECT * FROM students'

In [ ]:
# Query tersebut dibaca dan disimpan hasilnya dalam `df2` menggunakan Pandas
df2 = pd.DataFrame(engine_yosef.connect().execute(text(sql_query)))

# Menampilkan dataframe yang tersimpan
df2

   id            name  age  campus_id  total_grade
0   1      Rafif Iman   20          1         85.5
1   2    Hana Arisona   21          2         90.2
2   3    Raka Purnomo   19          1         78.9
3   4  Danu Irfansyah   20          3         92.7
4   5   Rachman Ardhi   22          2         88.1

### Aggregating (~~sqlalchemy~~)

In [ ]:
# Group by rerata dan menyimpan dalam `avg_grade_age`
avg_grade_age = df2.groupby('campus_id')[['total_grade','age']].mean().reset_index()

# Menunjukkan hasil/table
avg_grade_age

   campus_id  total_grade   age
0          1        82.20  19.5
1          2        89.15  21.5
2          3        92.70  20.0

### Create & Insert into Table (sqlalchemy)

In [ ]:
# Menambah table beserta isinya kedalam database yang tersimpan dalam instance `engine_yosef`
avg_grade_age.to_sql('avg_grade_age', engine_yosef, if_exists='replace', index=False)

3

Get info data type : SELECT * from INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME='avg_grade_age'

### Insert New Data (sqlalchemy)

In [ ]:
# Menginisiasi dictionary data siswa baru langsung koneksi ke nama kolom table-nya
new_data = {
    'name' : 'Uvuvwevwevwe Onyetenyevwe Ugwemubwem Osas',
    'age' : 17,
    'campus_id' : 1,
    'total_grade':85.5,
}

In [ ]:
# Membuat dataframe baru berisikan data baru saja
new_data = pd.DataFrame(new_data, index=[0])

In [ ]:
new_data

                                        name  age  campus_id  total_grade
0  Uvuvwevwevwe Onyetenyevwe Ugwemubwem Osas   17          1         85.5

In [ ]:
# Menambah baris/data baru dalam table yang sudah ada `students` (case sensitive)
new_data.to_sql('students',         # Menambah ke nama table yang sudah ada
                engine_yosef,       # Nama engine
                if_exists='append', # append agar menambah data
                index=False)        # index=False agar mengikuti index database-nya

1

In [ ]:
df2 = pd.DataFrame(engine_yosef.connect().execute(text(sql_query)))
df2

   id                                       name  age  campus_id  total_grade
0   1                                 Rafif Iman   20          1         85.5
1   2                               Hana Arisona   21          2         90.2
2   3                               Raka Purnomo   19          1         78.9
3   4                             Danu Irfansyah   20          3         92.7
4   5                              Rachman Ardhi   22          2         88.1
5   6  Uvuvwevwevwe Onyetenyevwe Ugwemubwem Osas   17          1         85.5

### Create Database (sqlalchemy)

In [ ]:
from sqlalchemy_utils import database_exists, create_database

In [ ]:
# Create engine or connection langsung ke databasenya (pysql_yosef_2)
engine_yosef = create_engine("postgresql://postgres:123456@localhost/pysql_yosef_2")

In [ ]:
# Engine baca url
engine_yosef.url

postgresql://postgres:***@localhost/pysql_yosef_2

In [ ]:
# Kondisi belum ada database dengan nama yang sama
if not database_exists(engine_yosef.url):
    # Membuat database-nya
    create_database(engine_yosef.url)
# Kondisi sudah ada database dengan nama yang sama
print(database_exists(engine_yosef.url))

True

### Create Table (sqlalchemy)

In [ ]:
from sqlalchemy import MetaData,Column,String,Integer,Table

In [ ]:
# Membuat object/instance metadata
metadata_yf = MetaData()

In [ ]:
profile = Table(
    'profile',                                  # Nama table
    metadata_yf,                                # Metadata yang digunakan
    Column('email', String, primary_key=True),  # Kolom-kolom
    Column('name', String),
    Column('contact', Integer),
)

In [ ]:
# Membuat table
metadata_yf.create_all(engine_yosef)

# Close Connection

## psycopg2

In [ ]:
connection.close()

yosef.close()

## sqlalchemy

In [ ]:
# engine_yosef.close()

engine_yosef.dispose()